; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-8-33)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-3 - location
	p0-5 - location
	p1-2 - location
	p2-3 - location
	p2-5 - location
	p3-1 - location
	p4-0 - location
	p4-3 - location
	p5-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s3)
	(at driver4 s1)
	(at driver5 s2)
	(at driver6 s1)
	(at driver7 s3)
	(at driver8 s5)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at truck8 s0)
	(empty truck8)
	(at package1 s1)
	(at package2 s4)
	(at package3 s3)
	(at package4 s3)
	(at package5 s3)
	(at package6 s4)
	(at package7 s2)
	(at package8 s0)
	(at package9 s2)
	(at package10 s5)
	(at package11 s4)
	(at package12 s5)
	(at package13 s4)
	(at package14 s5)
	(at package15 s3)
	(at package16 s0)
	(at package17 s0)
	(at package18 s1)
	(at package19 s4)
	(at package20 s1)
	(at package21 s2)
	(at package22 s2)
	(at package23 s4)
	(at package24 s4)
	(at package25 s5)
	(at package26 s3)
	(at package27 s2)
	(at package28 s5)
	(at package29 s3)
	(at package30 s2)
	(at package31 s3)
	(at package32 s1)
	(at package33 s0)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s2)
	(link s2 s1)
	(link s1 s4)
	(link s4 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s5)
	(link s5 s2)
	(link s4 s0)
	(link s0 s4)
	(link s4 s3)
	(link s3 s4)
)
	(:goal (and
	(at driver2 s2)
	(at driver4 s3)
	(at driver7 s3)
	(at driver8 s2)
	(at truck2 s2)
	(at truck4 s3)
	(at truck5 s0)
	(at truck6 s2)
	(at truck7 s4)
	(at truck8 s5)
	(at package1 s3)
	(at package2 s2)
	(at package3 s4)
	(at package4 s0)
	(at package5 s3)
	(at package7 s3)
	(at package8 s1)
	(at package9 s1)
	(at package10 s1)
	(at package11 s2)
	(at package12 s1)
	(at package13 s4)
	(at package14 s2)
	(at package15 s5)
	(at package16 s4)
	(at package17 s0)
	(at package18 s1)
	(at package19 s4)
	(at package20 s4)
	(at package21 s2)
	(at package22 s2)
	(at package23 s0)
	(at package25 s4)
	(at package26 s4)
	(at package27 s5)
	(at package28 s0)
	(at package29 s5)
	(at package30 s0)
	(at package31 s3)
	(at package32 s5)
	(at package33 s3)
	))


)

; plan
1. (board-truck driver5 s2 truck1)
   deleted: (at driver5 s2) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 11 of 41
2. (board-truck driver1 s2 truck5)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 11 of 41
3. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 11 of 41
4. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 12 of 41
5. (drive-truck driver5 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 12 of 41
6. (load-truck s5 package28 truck1)
   deleted: (at package28 s5)
   added: (in package28 truck1)
   goals met: 12 of 41
7. (load-truck s5 package25 truck1)
   deleted: (at package25 s5)
   added: (in package25 truck1)
   goals met: 12 of 41
8. (load-truck s5 package14 truck1)
   deleted: (at package14 s5)
   added: (in package14 truck1)
   goals met: 12 of 41
9. (drive-truck driver5 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 12 of 41
10. (drive-truck driver5 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 12 of 41
11. (load-truck s3 package4 truck1)
   deleted: (at package4 s3)
   added: (in package4 truck1)
   goals met: 12 of 41
12. (load-truck s3 package3 truck1)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 12 of 41
13. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 12 of 41
14. (load-truck s3 package26 truck1)
   deleted: (at package26 s3)
   added: (in package26 truck1)
   goals met: 12 of 41
15. (load-truck s3 package15 truck1)
   deleted: (at package15 s3)
   added: (in package15 truck1)
   goals met: 12 of 41
16. (drive-truck driver5 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 12 of 41
17. (drive-truck driver5 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 12 of 41
18. (load-truck s1 package32 truck1)
   deleted: (at package32 s1)
   added: (in package32 truck1)
   goals met: 12 of 41
19. (drive-truck driver5 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 12 of 41
20. (drive-truck driver5 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 12 of 41
21. (unload-truck s5 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s5)
   goals met: 13 of 41
22. (unload-truck s5 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s5)
   goals met: 14 of 41
23. (unload-truck s5 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s5)
   goals met: 15 of 41
24. (drive-truck driver5 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 15 of 41
25. (drive-truck driver5 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 15 of 41
26. (load-truck s1 package20 truck1)
   deleted: (at package20 s1)
   added: (in package20 truck1)
   goals met: 15 of 41
27. (drive-truck driver5 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 15 of 41
28. (unload-truck s4 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 16 of 41
29. (unload-truck s4 package26 truck1)
   deleted: (in package26 truck1)
   added: (at package26 s4)
   goals met: 17 of 41
30. (unload-truck s4 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s4)
   goals met: 18 of 41
31. (drive-truck driver5 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 18 of 41
32. (drive-truck driver5 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 18 of 41
33. (load-truck s2 package9 truck1)
   deleted: (at package9 s2)
   added: (in package9 truck1)
   goals met: 18 of 41
34. (drive-truck driver5 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 18 of 41
35. (unload-truck s1 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s1)
   goals met: 19 of 41
36. (load-truck s1 package1 truck1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 19 of 41
37. (drive-truck driver5 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 19 of 41
38. (load-truck s2 package7 truck1)
   deleted: (at package7 s2)
   added: (in package7 truck1)
   goals met: 19 of 41
39. (drive-truck driver5 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 19 of 41
40. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 20 of 41
41. (unload-truck s3 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   goals met: 21 of 41
42. (drive-truck driver5 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 21 of 41
43. (load-truck s4 package23 truck1)
   deleted: (at package23 s4)
   added: (in package23 truck1)
   goals met: 21 of 41
44. (unload-truck s4 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s4)
   goals met: 22 of 41
45. (drive-truck driver5 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 22 of 41
46. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 21 of 41
47. (load-truck s0 package8 truck1)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   goals met: 21 of 41
48. (unload-truck s0 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 22 of 41
49. (load-truck s0 package33 truck1)
   deleted: (at package33 s0)
   added: (in package33 truck1)
   goals met: 22 of 41
50. (unload-truck s0 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s0)
   goals met: 23 of 41
51. (unload-truck s0 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s0)
   goals met: 24 of 41
52. (load-truck s0 package16 truck1)
   deleted: (at package16 s0)
   added: (in package16 truck1)
   goals met: 24 of 41
53. (board-truck driver7 s3 truck6)
   deleted: (at driver7 s3) (empty truck6)
   added: (driving driver7 truck6)
   goals met: 23 of 41
54. (load-truck s4 package2 truck5)
   deleted: (at package2 s4)
   added: (in package2 truck5)
   goals met: 23 of 41
55. (load-truck s4 package11 truck5)
   deleted: (at package11 s4)
   added: (in package11 truck5)
   goals met: 23 of 41
56. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 24 of 41
57. (drive-truck driver1 s0 s5 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   goals met: 23 of 41
58. (drive-truck driver1 s5 s2 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   goals met: 23 of 41
59. (load-truck s2 package30 truck5)
   deleted: (at package30 s2)
   added: (in package30 truck5)
   goals met: 23 of 41
60. (drive-truck driver1 s2 s5 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   goals met: 23 of 41
61. (load-truck s5 package12 truck5)
   deleted: (at package12 s5)
   added: (in package12 truck5)
   goals met: 23 of 41
62. (drive-truck driver1 s5 s2 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   goals met: 23 of 41
63. (load-truck s2 package27 truck5)
   deleted: (at package27 s2)
   added: (in package27 truck5)
   goals met: 23 of 41
64. (drive-truck driver1 s2 s5 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   goals met: 23 of 41
65. (unload-truck s5 package27 truck5)
   deleted: (in package27 truck5)
   added: (at package27 s5)
   goals met: 24 of 41
66. (load-truck s5 package10 truck5)
   deleted: (at package10 s5)
   added: (in package10 truck5)
   goals met: 24 of 41
67. (drive-truck driver1 s5 s0 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   goals met: 25 of 41
68. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 24 of 41
69. (unload-truck s1 package12 truck5)
   deleted: (in package12 truck5)
   added: (at package12 s1)
   goals met: 25 of 41
70. (unload-truck s1 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s1)
   goals met: 26 of 41
71. (walk driver2 s5 p2-5)
   deleted: (at driver2 s5)
   added: (at driver2 p2-5)
   goals met: 26 of 41
72. (walk driver2 p2-5 s2)
   deleted: (at driver2 p2-5)
   added: (at driver2 s2)
   goals met: 27 of 41
73. (walk driver4 s1 p3-1)
   deleted: (at driver4 s1)
   added: (at driver4 p3-1)
   goals met: 27 of 41
74. (walk driver4 p3-1 s3)
   deleted: (at driver4 p3-1)
   added: (at driver4 s3)
   goals met: 28 of 41
75. (walk driver8 s5 p2-5)
   deleted: (at driver8 s5)
   added: (at driver8 p2-5)
   goals met: 28 of 41
76. (walk driver8 p2-5 s2)
   deleted: (at driver8 p2-5)
   added: (at driver8 s2)
   goals met: 29 of 41
77. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 30 of 41
78. (drive-truck driver5 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 30 of 41
79. (unload-truck s1 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 31 of 41
80. (drive-truck driver5 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 31 of 41
81. (drive-truck driver5 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 31 of 41
82. (unload-truck s3 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s3)
   goals met: 32 of 41
83. (unload-truck s0 package30 truck5)
   deleted: (in package30 truck5)
   added: (at package30 s0)
   goals met: 33 of 41
84. (drive-truck driver5 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 33 of 41
85. (unload-truck s2 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s2)
   goals met: 34 of 41
86. (drive-truck driver5 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 34 of 41
87. (drive-truck driver5 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 34 of 41
88. (unload-truck s4 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s4)
   goals met: 35 of 41
89. (drive-truck driver1 s0 s5 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   goals met: 34 of 41
90. (drive-truck driver1 s5 s2 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   goals met: 34 of 41
91. (unload-truck s2 package2 truck5)
   deleted: (in package2 truck5)
   added: (at package2 s2)
   goals met: 35 of 41
92. (unload-truck s2 package11 truck5)
   deleted: (in package11 truck5)
   added: (at package11 s2)
   goals met: 36 of 41
93. (drive-truck driver1 s2 s5 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   goals met: 36 of 41
94. (drive-truck driver1 s5 s0 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   goals met: 37 of 41
95. (disembark-truck driver1 s0 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s0) (empty truck5)
   goals met: 37 of 41
96. (board-truck driver1 s0 truck7)
   deleted: (at driver1 s0) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 37 of 41
97. (drive-truck driver1 s0 s4 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   goals met: 38 of 41
98. (disembark-truck driver7 s3 truck6)
   deleted: (driving driver7 truck6)
   added: (at driver7 s3) (empty truck6)
   goals met: 39 of 41
99. (walk driver7 s3 p0-3)
   deleted: (at driver7 s3)
   added: (at driver7 p0-3)
   goals met: 38 of 41
100. (walk driver7 p0-3 s0)
   deleted: (at driver7 p0-3)
   added: (at driver7 s0)
   goals met: 38 of 41
101. (board-truck driver7 s0 truck8)
   deleted: (at driver7 s0) (empty truck8)
   added: (driving driver7 truck8)
   goals met: 38 of 41
102. (drive-truck driver7 s0 s5 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s5)
   goals met: 39 of 41
103. (disembark-truck driver7 s5 truck8)
   deleted: (driving driver7 truck8)
   added: (at driver7 s5) (empty truck8)
   goals met: 39 of 41
104. (walk driver7 s5 p5-3)
   deleted: (at driver7 s5)
   added: (at driver7 p5-3)
   goals met: 39 of 41
105. (board-truck driver3 s3 truck6)
   deleted: (at driver3 s3) (empty truck6)
   added: (driving driver3 truck6)
   goals met: 39 of 41
106. (drive-truck driver3 s3 s2 truck6)
   deleted: (at truck6 s3)
   added: (at truck6 s2)
   goals met: 40 of 41
107. (walk driver7 p5-3 s3)
   deleted: (at driver7 p5-3)
   added: (at driver7 s3)
   goals met: 41 of 41
